<?php

namespace Database\Seeders;

use App\Models\Post;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {
        // \App\Models\User::factory(10)->create();
        $this->postSeeder();
    }

    public function postSeeder()
    {
        $title = 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ';
        $content = '<p>اگر کمی خوب نگاه کنیم، در زندگی هر کدام از ما حداقل یک فرد ویژه وجود دارد. او کسی است که مسیر اصلی زندگی‌مان را به ما نشان داده است و ما خواسته یا ناخواسته جا پای قدم‌های او گذاشته‌ایم. می‌توانیم غبار تاثیر این فرد را در تک‌تک تصمیم‌هایی که برای خودمان و زندگی‌مان می‌گیریم احساس کنیم.

        کم‌کم، آن‌قدر به او شبیه می‌شویم که با خود قبلی‌مان فرسنگ‌ها فاصله می‌گیریم. اگر این فرد، درست باشد، عاشق خودمان می‌‌شویم و اگر نادرست باشد، برای خود قبلی‌مان دلتنگ خواهیم شد. در این قسمت از «دیجیتالینگ» به سراغ «اینفلوئنسر مارکتینگ» می‌رویم و راهی برای کار با این افراد تاثیرگذار در زندگی کاربران پیدا می‌کنیم. با ما همراه باشید.    
</p>
<p>
    <b>اینفلوئنسر کیست؟</b><br>
    «اینفلوئنسر» یا «فرد تاثیرگذار» کسی است که روی جامعه‌ای از مخاطبان تاثیر می‌گذارد. اگر بخواهیم در مورد چند و چون این اثرگذاری با هم صحبت کنیم، رشته صحبت‌هایمان بیشتر به سمت تاثیرگذاری روی رفتار آدم‌ها کشیده می‌شود.

    این بدان معنی است که آن اینفلوئنسر با انجام کارها یا رفتارهایش به طور مستقیم باعث ایجاد رفتارهایی از همان دست در مخاطبان هدفش می‌شود. اگر کمی به اطرافمان خوب نگاه کنیم می‌بینیم که چقدر اطرافمان پر از اینفلوئنسر است. اجازه بدهید چند مورد را برایتان مثال بزنم:
    
    پدر و مادرمان
    دوستانمان
    خواهر و برادرمان
    استادهای دانشگاه
    همکارانمان
    اقوام دور و نزدیکی که با آنها رفت و آمد داریم یا حتی نداریم
    این افراد، کسانی هستند که می‌توانند روی یک تصمیم خاص ما اثر بگذارند. به همین دلیل در آن لحظه حساس برای ما نقش یک اینفلوئنسر را بازی می‌کند. پس با این حساب، اینفلوئنسر یا فرد تاثیرگذار، مفهوم تازه‌ای نیست.

</p>
<p>
    <b>اینفلوئنسر مارکتینگ چیست؟</b><br>
    در اینفلوئنسر مارکتینگ (Influencer marketing) یا «بازاریابی با افراد تاثیرگذار» ما به دنبال بازاریابی به کمک کسانی هستیم که نه فقط روی یک نفر بلکه روی افراد بسیار زیادی تاثیرگذار باشند. این افراد زیاد می‌توانند اعضای جامعه‌ای که مخاطب هدف ما یعنی مشتریانمان هستند را تشکیل دهند.

بنابراین، در اینفلوئنسر مارکتینگ از قدرت تاثیرگذاری آن فرد برای کمک به فروش محصول‌ها یا خدماتمان استفاده می‌کنیم. در واقع، آن فرد تاثیرگذر، حرف ما یا هدف ما را به عده خاصی که قبلا روی آنها تاثیر گذاشته است منتقل می‌کند و باعث می‌شود که آنها یک رفتار هدفمند مثل خرید را انجام دهند .

</p>
<p>
    <b>اینفلوئنسر مارکتینگ و شبکه‌های اجتماعی</b><br>
    ممکن است برخی از خوانندگان این مقاله فکر کنند که اینفلوئنسر مارکتینگ تنها در شبکه‌های اجتماعی به ویژه اینستاگرام رخ می‌دهد. اما در حقیقت، این ماجرا می‌تواند در فضای واقعی و غیر آنلاین نیز اتفاق بیفتد. مثلا وقتی یک استاد دانشگاه سر کلاسش یک کتاب خاص از یک نویسنده خاص را معرفی می‌کند یا هنگامی که یک سخنران در طول صحبت‌هایش به برخی برندها یا خدماتشان اشاره می‌کند نیز اینفلوئنسر مارکتینگ صورت گرفته است.

پس این ماجرا تنها محدود به اینستاگرام و افراد معروفی که تعداد فالوئر بالا دارند نمی‌شود. افراد دیگری مانند بلاگرها، پادکسترها و نویسندگان نیز در فضای آنلاین هستند که می‌توانند اینفلوئنسر مارکتینگ را برای ما انجام دهند.

در واقع، چیزی که باعث این اشتباه و نادیده گرفتن افراد تاثیرگذار دیگر می‌شود، معیار نادرستی است که برای شناسایی یک اینفلوئنسر در ذهن ما ثبت شده است. بیشتر ما فکر می‌کنیم تمام افرادی که تعداد فالوئر بالایی دارند، اینفلوئنسر هستند. مهم‌ترین نکته این است که آیا آن فرد می‌تواند اینفلوئنسر خوبی برای کسب و کار ما به حساب بیاد؟

</p>
<p>
    <b>خلاصه‌ای از آنچه با هم از اینفلوئنسر مارکتینگ گفتیم:</b><br>
«اینفلوئنسر» مفهومی محدود به شبکه‌های اجتماعی نیست. هر فردی که قدرت تاثیرگذاری روی دیگران را داشته باشد، اینفلوئنسر است.
«اینفلوئنسر مارکتینگ» روشی برای بازاریابی است که در آن از قدرت نفوذ اینفلوئنسرها روی طرفدارانشان برای تبلیغ محصول‌ها یا خدمات خودمان استفاده می‌کنیم.
داشتن یک پیج پر از ممبر در شبکه‌های اجتماعی، از یک فرد خاص، اینفلوئنسر نمی‌سازد. شما باید با توجه به هدفی که از تبلیغات دارید، فردی را برای این کار انتخاب کنید.
مواردی مانند «تناسب اینفلوئنسر با جامعه هدف مورد نظر ما»، «میزان اثرگذاری اینفلوئنسر» و «بررسی تبلیغات قبلی اینفلوئنسر» می‌توانند به عنوان فیلترهای انتخاب یک فرد مناسب برای تبلیغ شما در نظر گرفته شوند.
تحت فشار گذاشتن اینفلوئنسر برای بیان و اجرای تبلیغ به سبکی که شما می‌پسندید، راه خوبی برای تبلیغ نیست و نتیجه قابل قبولی را در اختیار شما قرار نمی‌دهد.

</p>';
        $seeds = [
            [
                'content'   =>  $content,
                'title' =>  $title,
                'image' =>  'assets/img/influencers-1440x685 (1).png'
            ],
            [
                'content'   =>  $content,
                'title' =>  $title,
                'image' =>  'assets/img/digital-marketing-anayltics-1280x685.png'
            ],
            [
                'content'   =>  $content,
                'title' =>  $title,
                'image' =>  'assets/img/Instagram-follower-1 (1).png'
            ],
            [
                'content'   =>  $content,
                'title' =>  $title,
                'image' =>  'assets/img/what-is-Keyword-density (1).jpg'
            ],
            [
                'content'   =>  $content,
                'title' =>  $title,
                'image' =>  'assets/img/what-are-keywords (1).jpg'
            ],
            [
                'content'   =>  $content,
                'title' =>  $title,
                'image' =>  'assets/img/what-is-pointer.jpg'
            ],
        ];
        Post::truncate();
        foreach( $seeds as $seed ) {
            Post::create($seed);
        }
    }
}
