@extends('layouts.Layouts')
@section('content')
<!-- Start More-info Section -->
<div class="container">
    <div class="more-info">
        <div class="more-info-content">
            <img class="img-responsive" src="./assets/img/img-target.jpg" alt="">
           <p>
               <b>توافقنامه شرائط و قوانین سایت دیجیتالینگ</b><br>
               شرایط ذیل به‌عنوان یک قرارداد الزام‌آور بر روابط بین کاربران و وب سایت دیجیتالینگ حاکم خواهد بود. بر این اساس، ضروری است پیش از استفاده از خدمات وبسایت، این شروط را به‌دقت مطالعه فرمایید. استفاده از خدمات مذکور به‌منزله‌ی قبول تمامی شرایط ذیل است و هرگونه ادعا یا اعتراض آتی در این خصوص را بلااعتبار می‌‌نماید
           </p>
           <p>
               <b>مالکیت حقوق موجود در وبسایت دیجیتالینگ</b><br>
               <p>مالکیت مادی و معنوی کلیه مطالب و موارد موجود در وبسایت دیجیتالینگ از جمله متون، کلیپ های آموزشی و… و نیز نام، علامت تجاری و خدمات ارائه‌شده تحت این نام و … متعلق به دیجیتالینگ است و در نتیجه:
                   <br>
                   کاربران تنها اجازه‌ی استفاده‌ی محدود و غیرانحصاری از خدمات آن را تحت شرایط قرارداد حاضر دارند، بدون آن که این استفاده حقی برای آن‌ها نسبت به مالکیت وبسایت دیجیتالینگ، مطالب و موارد موجود در آن و یا سایر حقوق معنوی مربوطه ایجاد نماید یا اجازه‌ی استفاده از نام، علامت تجاری، لوگو و … را به آن‌ها اعطا نماید.
                   <br>
                   کاربران نمی‌‌توانند سایت دیجیتالینگ را تغییر دهند، بازتولید یا بازنویسی کنند یا از آن برای تولید یک برنامه‌ی مشابه استفاده نمایند.
                   <br>
                   کاربران مجاز به استفاده از خدمات دیجیتالینگ جز در شرایط مقرر در این قرارداد نیستند.
               </p>
           </p>
        </div>
        <div class="more-info-news">
            <div class="news">
                <img class="img-responsive" src="./assets/img/n-1.jpg" alt="">
            </div>
            <div class="news">
                <img class="img-responsive" src="./assets/img/newss2.jpg" alt="">
            </div>
        </div>
    </div>
</div>
<!-- End More-info Section -->
@endsection