@extends('layouts.Layouts');
@section('content')
<div class="container">
    <div class="more-info">
        <div class="more-info-content">
            <img class="img-responsive" src="./assets/img/begin-from.jpg" alt="">
            <p>
                <b>دیجیتال مارکتینگ را از کجا شروع کنیم؟</b><br>
                دیجیتال مارکتینگ شاخه‌ای از بازاریابی است که این روزها به لطف پیشرفت اینترنت بسیار مورد توجه قرار گرفته است. اگر بخواهیم ساده تعریف کنیم به کلیه فعالیت‌هایی که در اینترنت و شبکه‌های اجتماعی، برای تبلیغات، فروش بیشتر و برندینگ انجام می‌شود دیجیتال مارکتینگ می‌گویند.

امروزه این شغل به علت اینترنتی شدن کسب و کارها و سرعت بالای پیشرفت تکنولوژی درآمد خوبی داشته و مورد توجه قرار گرفته است. اما یادیگری دیجیتال مارکتینگ را از کجا باید شروع کنید؟ این سوالی است که در مقاله به آن پاسخ خواهیم داد پس با ما همراه باشید.
            </p>
            <p>
                <b>آشنایی با زیر شاخه‌های دیجیتال مارکتینگ</b><br>
                با اینکه بازاریابی دیجیتال خود از زیرشاخه‌های علم بازاریابی است اما خود نیز به زیرشاخه‌های مختلفی تقسیم شده است. برای یادگیری دیجیتال مارکتینگ باید با این شاخه‌ها آشنا شوید و یکی از شاخه‌ها را که حس می‌کنید به استعداد و علاقه شما نزدیکتر است انتخاب کنید تا یادگیری را شروع کنید.
            </p>
            <p>
                <b>۱-سئو</b><br>
                سئو به معنای بهینه سازی سایت برای موتورهای جست و جو است. سئو شامل فعالیت‌هایی نظیر تولید محتوا، لینک سازی داخلی و خارجی، و بهینه سازی تکنیکال سایت می‌شود. تمام این فعالیت‌ها باعث می‌شود تا سایت شما در کلمات کلیدی مورد نظر رنک خوبی در موتورهای جستجو بگیرند.
            </p>
            <p>
                <b>۲-طراحی سایت</b><br>
                برای موفقیت در دنیای اینترنت بخصوص برای کسب و کارها داشتن یک سایت می‌تواند مفید باشد. بدون طراحی سایت، سئو، برخی تبلیغات و … کاربردی نخواهند داشت. پس طراحی سایت از مهمترین زیرشاخه‌های دیجیتال مارکتینگ است.
            </p>
            <p>
                <b>۳-تبلیغات</b><br>
                تبلیغات در دنیای اینترنت حالات مختلفی دارد. تبلیغات می‌تواند به صورت رپورتاژ، بنری، همسان یا حتی تبلیغات در شبکه‌های اجتماعی باشد. نوعی از تبلیغات دیگر نیز گوگل ادز نام دارد که به علت پیچیدگی و سختی بالا خود یکی از زیرشاخه‌های دیجیتال مارکتینگ است.
            </p>
            <p>
                <b>۴-رسانه های اجتماعی</b><br>
                رسانه های اجتماعی شبکه های قدرتمندی هستند که میتواند ارزش برند شما را بیشتر کند.

یک کارشناس دیجیتال مارکتینگ باید در شبکه های اجتماعی از روابط عمومی،خلاقیت در تولید محتوا،اطلاع از بروزترین ترندهای روز برخوردار باشد.
            </p>
            <p>
                <b>۵-گوگل ادز</b><br>
                گوگل ادز ابزار گوگل برای تبلیغات است که با استفاده از ان میتوانید تبلیغات خود را در لینک‌های اول جستجوی گوگل نشان داد.

البته کار با این ابزار اصول و قواعد خاص خود را دارد تا بتوانید با کمترین هزینه بهترین نتیجه را بگیرید.
            </p>
            <p>
                <b>۶-بازاریابی محتوایی</b><br>
                بازاریابی محتوا یعنی به اشتراک گذاشتن محتوای کاربردی و مناسب که مورد علاقه مخاطب باشد و نیازآنها را برطرف کند. بطور کلی محتوا می‌تواند به صورت: مقاله،ویدئو،کتاب،صدا،تصویر و یا… باشد که در سایت یا شبکه‌های اجتماعی منتشر می‌شود.
            </p>
            <p>
                <b>۷-تجزیه و تحلیل</b><br>
                یک کارشناس دیجیتال مارکتینگ باید بتواند با استفاده از داده های ابزارهای مختلف مانند سرچ کنسول و آنالیتیکس و … عملکرد خود را بسنجد. نقاط قوت و ضعف را شناسایی کند و کار خود را بهبود بخشد.
            </p>
        </div>
        <div class="more-info-news">
            <div class="news">
                <img class="img-responsive" src="./assets/img/n-1.jpg" alt="">
            </div>
            <div class="news">
                <img class="img-responsive" src="./assets/img/newss2.jpg" alt="">
            </div>
        </div>
    </div>
</div>
@endsection