@extends('layouts.Layouts')
@section('content')
<!-- Start More-info Section -->
<div class="container">
    <div class="more-info">
        <div class="more-info-content">
            <img class="img-responsive" src="./assets/img/story.jpg" alt="">
           <p>
               <b>داستان
                دیجیتالینگ</b><br>

                همه چیز از یک پرسش ساده شروع شد: «دیجیتال مارکتینگ چیست؟» برای یافتن این پرسش سه واژه‌ای، ماه‌های زیادی را لابه‌لای وب‌سایت‌های ایرانی و خارجی سپری کردم.
<br>
در کنار این جستجوی دیجیتالی، در کلاس‌ها و همایش‌های گوناگونی حاضر شدم تا عمیق‌تر یاد بگیرم. علاقه‌ من به اشتراک‌گذاری آموخته‌هایم مرا به سمت راه‌اندازی دیجیتالینگ سوق داد.
<br>
در کانال تلگرامی دیجیتالینگ، هر آنچه که یاد گرفته بودم را با تجربه‌هایم از کار در شرکت‌های مختلف ترکیب کردم و همه آنها را در قالب پادکست به اشتراک گذاشتم. فیدبک‌های خوبی که از کاربران دریافت کردم به من نشان داد که تلاشم بیهوده نبوده است.
<br>
بعد از مدتی تصمیم گرفتم تجربه‌هایم را از طریق وبینار در اختیار کاربران قرار دهم. برگزاری نزدیک به ۲۰ ساعت، آموزش ویدیویی که این بار هم با استقبال خوبی از طرف کاربران روبه‌رو شد، مرا به فکر گسترش این مسیر و راه‌اندازی وب‌سایت دیجیتالینگ انداخت. اما حجم کار بالا بود و به تنهایی نمی‌توانستم حرکت کنم.
<br>
کم‌کم اعضای تیم دیجیتالینگ مثل تکه‌های یک پازل در کنار هم قرار گرفتند. حالا دیگر در پشت صحنه دیجیتالینگ فقط مطهره وجود ندارد. من به ما تبدیل شد و کارهای کوچک به قدم‌هایی بزرگ تغییر شکل دادند.
<br>
ما در مدرسه دیجیتالینگ به دنبال آموزشی واقعی هستیم. به همین دلیل، تجربه‌های خودمان را در اختیار علاقه‌مندان به دنیای بازاریابی دیجیتال قرار می‌دهیم. نتیجه این کار، یادگیری واقعی و رشد کردن است؛ یعنی همان چیزی که ما به دنبال آن هستیم.
           </p>
        </div>
        <div class="more-info-news">
            <div class="news">
                <img class="img-responsive" src="./assets/img/n-1.jpg" alt="">
            </div>
            <div class="news">
                <img class="img-responsive" src="./assets/img/newss2.jpg" alt="">
            </div>
        </div>
    </div>
</div>
<!-- End More-info Section -->
@endsection